/datum/lazy_template/virtual_domain/abductor_mothership
	name = "Abductor Mothership"
	cost = BITRUNNER_COST_HIGH
	desc = "Invade an Abductor Mothership to retrieve alien research, advanced bitrunning disks, and who knows what else. \
	(Two Caches Available)"
	difficulty = BITRUNNER_DIFFICULTY_HIGH
	completion_loot = list(
		/obj/item/stack/spacecash/c200 = 1,
		/obj/item/stack/spacecash/c100 = 2,
		/obj/item/cardboard_cutout/abductor = 1,
		)
	help_text = "An abductor mothership bordering on a space station has taken hold of 'primitive' technology for research. \
	Turn the tables and take some of their equipment for research, instead!"
	key = "abductormothership"
	map_name = "abductor_mothership"
	mob_modules = list(
		/datum/modular_mob_segment/novabductors
	)
	reward_points = BITRUNNER_REWARD_HIGH
	secondary_loot = list( // this domain has lots of crates, so we need a big list.
		/obj/item/stack/spacecash/c100 = 6, // buffer the good stuff with cash and abductors merch
		/obj/item/stack/spacecash/c200 = 3,
		/obj/item/poster/random_abductor = 8,
		/obj/item/toy/plush/abductor = 4,
		/obj/item/toy/plush/abductor/agent = 4,
		/obj/item/bitrunning_disk/item/abductors = 6,
		/obj/item/clothing/under/abductor = 6,
		/obj/item/storage/belt/military/abductor = 2,
		/obj/item/clothing/head/helmet/abductor = 1, // this is strong, but it's head armor.
		/obj/item/clothing/suit/armor/abductor/vest = 3, // worse than a normal armor vest
		/obj/item/gun/energy/laser/chameleon/energy_only = 2,
		/obj/item/gun/energy/alien/astrum/domain = 2, // this is barely better than an allstar
		/obj/item/multitool/abductor = 1,
		/obj/item/screwdriver/abductor = 1,
		/obj/item/wrench/abductor = 1,
		/obj/item/bodypart/head/abductor = 1,
	)

/datum/modular_mob_segment/novabductors
	max = 6
	mobs = list(
		/mob/living/basic/trooper/abductor/nova/melee,
		/mob/living/basic/trooper/abductor/nova/melee/armored,
		/mob/living/basic/trooper/abductor/nova/melee/heavy,
		/mob/living/basic/trooper/abductor/nova/ranged,
		/mob/living/basic/trooper/abductor/nova/ranged/armored,
		/mob/living/basic/trooper/abductor/nova/ranged/heavy
	)

/mob/living/basic/slime/pinkpurple

/mob/living/basic/slime/pinkpurple/Initialize(mapload, new_colour, new_life_stage)
	return ..(mapload, prob(50) ? /datum/slime_type/pink : /datum/slime_type/purple, prob(10) ? SLIME_LIFE_STAGE_ADULT : SLIME_LIFE_STAGE_BABY)

/turf/open/floor/glass/abductor // more intense blue glow to better light the map, for when glowy plants don't fit the space
	name = "sturdy glass floor"
	desc = "The pearly glow of starlight and the vastness of the cosmos are just under your feet."
	starlight_color = COLOR_BRIGHT_BLUE

/obj/structure/window/reinforced/plasma/fulltile/glowing // light the outer hallways in beautiful purple
	desc = "You can't tell if it's aurora caelus, your imagination, or if the beauty of the cosmos is glimmering just for you."
	light_color = COLOR_STRONG_VIOLET
	light_range = 4


// notes (i.e. walls of text)
// abductor language is written in wingdings (i.e. ✌︎♌︎♎︎◆︎❄︎♏︎♍︎♒︎)

/obj/item/paper/fluff/abductor
	name = "Abductor Datapad"
	desc = "An abductor datapad."
	icon_state = "alienpaper_words"
	show_written_words = FALSE
	default_raw_text = {"<b>☟︎☜︎✌︎👎︎☜︎☼︎</b><br>

<br>
🕆︎☠︎☞︎✋︎☹︎☹︎☜︎👎︎ ❄︎☜︎✠︎❄︎📬︎<br>
🕆︎☠︎☞︎✋︎☹︎☹︎☜︎👎︎ ❄︎☜︎✠︎❄︎📬︎<br>
🕈︎☟︎✌︎❄︎ 👎︎⚐︎ ✡︎⚐︎🕆︎ ❄︎🕈︎⚐︎ ❄︎☟︎✋︎☠︎😐︎✍︎"}

/obj/item/paper/fluff/abductor/click_alt()
	return CLICK_ACTION_BLOCKING

/obj/item/paper/fluff/abductor/lanca
	name = "Ballistic Weapon Research Goals: Lanca"
	default_raw_text = {"<b>☼︎♏︎⬧︎♏︎♋︎❒︎♍︎♒︎ ☝︎□︎♋︎●︎ 👌︎❒︎♓︎♏︎♐︎♓︎■︎♑︎🖳︎ 'Lanca'</b><br>

<br>
✌︎⬧︎ ◻︎❒︎♏︎❖︎♓︎□︎◆︎⬧︎●︎⍓︎ ♌︎❒︎♓︎♏︎♐︎♏︎♎︎📪︎ ♏︎♋︎♍︎♒︎ ●︎♋︎♌︎ ♓︎■︎ ⧫︎♒︎♏︎ ❒︎♏︎⬧︎♏︎♋︎❒︎♍︎♒︎ ♎︎♓︎❖︎♓︎⬧︎♓︎□︎■︎ ♒︎♋︎⬧︎ ♌︎♏︎♏︎■︎ ♎︎♏︎●︎♓︎❖︎♏︎❒︎♏︎♎︎ ♋︎ ❒︎♏︎♍︎□︎❖︎♏︎❒︎♏︎♎︎ ⬥︎♏︎♋︎◻︎□︎■︎ ♐︎❒︎□︎❍︎ □︎◆︎❒︎ ☝︎❒︎□︎◆︎◻︎⬧︎ □︎♐︎ ☞︎□︎♍︎◆︎⬧︎📪︎ □︎♐︎⧫︎♏︎■︎ ♎︎♏︎◻︎●︎□︎⍓︎♏︎♎︎ □︎■︎ □︎❒︎ ■︎♏︎♋︎❒︎ 💧︎◻︎♋︎♍︎♏︎ 💧︎⧫︎♋︎⧫︎♓︎□︎■︎ 📂︎🗏︎📬︎ ✡︎□︎◆︎ ♋︎❒︎♏︎ ⧫︎□︎ ⧫︎❒︎♏︎♋︎⧫︎ ⧫︎♒︎♏︎⬧︎♏︎ ⬥︎♏︎♋︎◻︎□︎■︎⬧︎ ⬧︎♏︎♍︎◆︎❒︎♏︎●︎⍓︎ ♋︎⬧︎ ⍓︎□︎◆︎ ⬥︎□︎◆︎●︎♎︎ ⬥︎♓︎⧫︎♒︎ ♋︎■︎⍓︎ □︎⧫︎♒︎♏︎❒︎ ❒︎♏︎♍︎□︎❖︎♏︎❒︎♏︎♎︎ ⬧︎◆︎♌︎🙰♏︎♍︎⧫︎📬︎<br>
💧︎◆︎♌︎🙰♏︎♍︎⧫︎ ✌︎◆︎⧫︎□︎◻︎⬧︎⍓︎ ☹︎♋︎♌︎🖳︎ ✡︎□︎◆︎ ♒︎♋︎❖︎♏︎ ♌︎♏︎♏︎■︎ ♓︎⬧︎⬧︎◆︎♏︎♎︎ ♋︎ ⬧︎♓︎■︎♑︎●︎♏︎ 🕯︎☹︎♋︎■︎♍︎♋︎🕯︎ ⬥︎♏︎♋︎◻︎□︎■︎ ❍︎♋︎■︎◆︎♐︎♋︎♍︎⧫︎◆︎❒︎♏︎♎︎ ♌︎⍓︎ ⧫︎♒︎♏︎ ♍︎□︎❍︎◻︎♋︎■︎⍓︎ 🕯︎💧︎⌘︎□︎⧫︎ 👎︎⍓︎■︎♋︎❍︎♓︎♍︎♋︎🕯︎📬︎ ✋︎⧫︎ ♓︎⬧︎ ♋︎ ⬧︎●︎□︎⬥︎📫︎♐︎♓︎❒︎♓︎■︎♑︎📪︎ ♒︎♓︎♑︎♒︎📫︎●︎♏︎⧫︎♒︎♋︎●︎♓︎⧫︎⍓︎ ⬥︎♏︎♋︎◻︎□︎■︎ ♓︎♎︎♏︎■︎⧫︎♓︎♐︎♓︎♏︎♎︎ ♌︎⍓︎ ⬧︎◆︎♌︎🙰♏︎♍︎⧫︎ ♎︎□︎♍︎◆︎❍︎♏︎■︎⧫︎⬧︎ ♋︎⬧︎ 🕯︎♌︎♋︎●︎●︎♓︎⬧︎⧫︎♓︎♍︎🕯︎📪︎ ♋︎⬧︎ ⬥︎♓︎⧫︎♒︎ □︎⧫︎♒︎♏︎❒︎ ❒︎♏︎♍︎□︎❖︎♏︎❒︎♏︎♎︎ ⬥︎♏︎♋︎◻︎□︎■︎❒︎⍓︎📬︎ ✡︎□︎◆︎ ♋︎❒︎♏︎ ⧫︎□︎ ♏︎⌧︎⧫︎♏︎■︎⬧︎♓︎❖︎♏︎●︎⍓︎ ⧫︎♏︎⬧︎⧫︎📪︎ ♎︎♏︎♍︎□︎■︎⬧︎⧫︎❒︎◆︎♍︎⧫︎📪︎ ♋︎■︎♎︎ ❒︎♏︎♍︎□︎■︎⬧︎⧫︎❒︎◆︎♍︎⧫︎ ⧫︎♒︎♓︎⬧︎ ◻︎♓︎♏︎♍︎♏︎ □︎♐︎ ⬥︎♏︎♋︎◻︎□︎■︎❒︎⍓︎📪︎ ♋︎■︎♎︎ ❒︎♏︎◻︎□︎❒︎⧫︎ □︎■︎ ♓︎⧫︎⬧︎ ♐︎♓︎❒︎♓︎■︎♑︎ ❍︎♏︎♍︎♒︎♋︎■︎♓︎⬧︎❍︎⬧︎ ♋︎■︎♎︎ ◻︎□︎⧫︎♏︎■︎⧫︎♓︎♋︎●︎ ♋︎◻︎◻︎●︎♓︎♍︎♋︎⧫︎♓︎□︎■︎⬧︎ ⧫︎□︎ □︎◆︎❒︎ ♑︎□︎♋︎●︎⬧︎📬︎<br>
🏱︎❒︎□︎❖︎♓︎♎︎♏︎♎︎ ♋︎❒︎♏︎ ⬧︎♏︎❖︎♏︎❒︎♋︎●︎ ♓︎■︎⬧︎⧫︎♋︎■︎♍︎♏︎⬧︎ □︎♐︎ 💧︎⌘︎□︎⧫︎ 👎︎⍓︎■︎♋︎❍︎♓︎♍︎♋︎ ❍︎♋︎♑︎♋︎⌘︎♓︎■︎♏︎⬧︎ ♋︎■︎♎︎ ❒︎□︎◆︎■︎♎︎⬧︎ ♐︎♓︎⧫︎ ♐︎□︎❒︎ ⧫︎♒︎♏︎ ⬥︎♏︎♋︎◻︎□︎■︎📪︎ ♋︎⬧︎ ⬥︎♏︎●︎●︎ ♋︎⬧︎ ♋︎ 🕯︎⬧︎◆︎◻︎◻︎❒︎♏︎⬧︎⬧︎□︎❒︎🕯︎ ♓︎■︎⧫︎♏︎■︎♎︎♏︎♎︎ ⧫︎□︎ ❍︎♋︎🙵♏︎ ⧫︎♒︎♓︎⬧︎ □︎⧫︎♒︎♏︎❒︎⬥︎♓︎⬧︎♏︎ ●︎□︎◆︎♎︎ ⬥︎♏︎♋︎◻︎□︎■︎ ❍︎◆︎♍︎♒︎ ❑︎◆︎♓︎♏︎⧫︎♏︎❒︎📬︎<br>"}


/obj/item/paper/fluff/abductor/sindano
	name = "Ballistic Weapon Research Goals: Sindano"
	default_raw_text = {"<b>☼︎♏︎⬧︎♏︎♋︎❒︎♍︎♒︎ ☝︎□︎♋︎●︎ 👌︎❒︎♓︎♏︎♐︎♓︎■︎♑︎🖳︎ 'Sindano'</b><br>

<br>
✌︎⬧︎ ◻︎❒︎♏︎❖︎♓︎□︎◆︎⬧︎●︎⍓︎ ♌︎❒︎♓︎♏︎♐︎♏︎♎︎📪︎ ♏︎♋︎♍︎♒︎ ●︎♋︎♌︎ ♓︎■︎ ⧫︎♒︎♏︎ ❒︎♏︎⬧︎♏︎♋︎❒︎♍︎♒︎ ♎︎♓︎❖︎♓︎⬧︎♓︎□︎■︎ ♒︎♋︎⬧︎ ♌︎♏︎♏︎■︎ ♎︎♏︎●︎♓︎❖︎♏︎❒︎♏︎♎︎ ♋︎ ❒︎♏︎♍︎□︎❖︎♏︎❒︎♏︎♎︎ ⬥︎♏︎♋︎◻︎□︎■︎ ♐︎❒︎□︎❍︎ □︎◆︎❒︎ ☝︎❒︎□︎◆︎◻︎⬧︎ □︎♐︎ ☞︎□︎♍︎◆︎⬧︎📪︎ □︎♐︎⧫︎♏︎■︎ ♎︎♏︎◻︎●︎□︎⍓︎♏︎♎︎ □︎■︎ □︎❒︎ ■︎♏︎♋︎❒︎ 💧︎◻︎♋︎♍︎♏︎ 💧︎⧫︎♋︎⧫︎♓︎□︎■︎ 📂︎🗏︎📬︎ ✡︎□︎◆︎ ♋︎❒︎♏︎ ⧫︎□︎ ⧫︎❒︎♏︎♋︎⧫︎ ⧫︎♒︎♏︎⬧︎♏︎ ⬥︎♏︎♋︎◻︎□︎■︎⬧︎ ⬧︎♏︎♍︎◆︎❒︎♏︎●︎⍓︎ ♋︎⬧︎ ⍓︎□︎◆︎ ⬥︎□︎◆︎●︎♎︎ ⬥︎♓︎⧫︎♒︎ ♋︎■︎⍓︎ □︎⧫︎♒︎♏︎❒︎ ❒︎♏︎♍︎□︎❖︎♏︎❒︎♏︎♎︎ ⬧︎◆︎♌︎🙰♏︎♍︎⧫︎📬︎<br>
💧︎︎◆︎︎♌︎︎🙰♏︎︎♍︎︎⧫︎︎ 👍︎□︎■︎⧫︎♋︎♓︎■︎❍︎♏︎■︎⧫︎ ☹︎︎♋︎︎♌︎︎🖳︎︎ ✡︎︎□︎︎◆︎︎ ♒︎︎♋︎︎❖︎︎♏︎︎ ♌︎︎♏︎︎♏︎︎■︎︎ ♓︎︎⬧︎︎⬧︎︎◆︎︎♏︎︎♎︎︎ ♋︎︎ ⬧︎︎♓︎︎■︎︎♑︎︎●︎︎♏︎︎ 🕯︎︎💧︎♓︎■︎♎︎♋︎■︎□︎🕯︎︎ ⬥︎︎♏︎︎♋︎︎◻︎︎□︎︎■︎︎ ❍︎︎♋︎︎■︎︎◆︎︎♐︎︎♋︎︎♍︎︎⧫︎︎◆︎︎❒︎︎♏︎︎♎︎︎ ♌︎︎⍓︎︎ ⧫︎︎♒︎︎♏︎︎ ♍︎︎□︎︎❍︎︎◻︎︎♋︎︎■︎︎⍓︎︎ 🕯︎︎👍︎♋︎❒︎⬥︎□︎ 👎︎♏︎♐︎♏︎■︎⬧︎♏︎ 💧︎⍓︎⬧︎⧫︎♏︎❍︎⬧︎🕯︎︎📬︎︎ ✋︎⧫︎ ♓︎⬧︎ ♋︎ 🕯︎⬧︎❍︎♋︎●︎●︎📫︎♍︎♋︎●︎♓︎♌︎♏︎❒︎🕯︎ ⬥︎♏︎♋︎◻︎□︎■︎ ⧫︎♒︎♋︎⧫︎ ♐︎♓︎❒︎♏︎⬧︎ ◆︎■︎♎︎♏︎❒︎⬧︎♓︎⌘︎♏︎♎︎ ◻︎❒︎□︎🙰♏︎♍︎⧫︎♓︎●︎♏︎⬧︎ ❒︎♋︎◻︎♓︎♎︎●︎⍓︎📬︎ ✋︎⧫︎ ♒︎♋︎⬧︎ ♍︎□︎■︎⧫︎♓︎■︎◆︎♏︎♎︎ ⧫︎□︎ ♌︎♋︎♐︎♐︎●︎♏︎ ◆︎⬧︎ ♒︎□︎⬥︎ ⧫︎♒︎♓︎⬧︎ ⬥︎♏︎♋︎◻︎□︎■︎ ♋︎◻︎◻︎♏︎♋︎❒︎⬧︎ ⧫︎□︎ ♌︎♏︎ ⬧︎♏︎♏︎■︎ ♋︎⬧︎ ♋︎ ⬧︎⧫︎♋︎◻︎●︎♏︎ ◻︎♓︎♏︎♍︎♏︎ □︎♐︎ ⬥︎♏︎♋︎◻︎□︎■︎❒︎⍓︎ ♐︎□︎❒︎ ⧫︎♒︎♏︎ ♋︎❒︎❍︎♏︎♎︎ ♐︎□︎❒︎♍︎♏︎⬧︎ □︎♐︎ ⧫︎♒︎♏︎ 💧︎□︎●︎ ☞︎♏︎♎︎♏︎❒︎♋︎⧫︎♓︎□︎■︎📪︎ ♋︎■︎♎︎ ♓︎⧫︎ ♓︎⬧︎ ⍓︎□︎◆︎❒︎ 🙰□︎♌︎ ⧫︎□︎ ♎︎♓︎⬧︎♍︎□︎❖︎♏︎❒︎ ⬥︎♒︎⍓︎ ⧫︎♒︎♏︎⍓︎ ♐︎♓︎■︎♎︎ ♓︎⧫︎ ⬧︎□︎ ◆︎⬧︎♏︎♐︎◆︎●︎ ♋︎■︎♎︎ ♎︎♏︎♍︎□︎■︎⬧︎⧫︎❒︎◆︎♍︎⧫︎ ♓︎⧫︎⬧︎ ♐︎♓︎❒︎♓︎■︎♑︎ ⬧︎⍓︎⬧︎⧫︎♏︎❍︎⬧︎ ♐︎□︎❒︎ □︎◆︎❒︎ ♏︎■︎♑︎♓︎■︎♏︎♏︎❒︎⬧︎📬︎<br>
🏱︎︎❒︎︎□︎︎❖︎︎♓︎︎♎︎︎♏︎︎♎︎︎ ♋︎︎❒︎︎♏︎︎ ⬧︎︎♏︎︎❖︎︎♏︎︎❒︎︎♋︎︎●︎︎ ♓︎︎■︎︎⬧︎︎⧫︎︎♋︎︎■︎︎♍︎︎♏︎︎⬧︎︎ □︎︎♐︎︎ 👍︎♋︎❒︎⬥︎□︎ 👎︎♏︎♐︎♏︎■︎⬧︎♏︎ 💧︎⍓︎⬧︎⧫︎♏︎❍︎⬧︎ ❍︎︎♋︎︎♑︎︎♋︎︎⌘︎︎♓︎︎■︎︎♏︎︎⬧︎︎ ♋︎︎■︎︎♎︎︎ ❒︎︎□︎︎◆︎︎■︎︎♎︎︎⬧︎︎ ♐︎︎♓︎︎⧫︎︎ ♐︎︎□︎︎❒︎︎ ⧫︎︎♒︎︎♏︎︎ ⬥︎︎♏︎︎♋︎︎◻︎︎□︎︎■︎︎📬︎︎<br>"}

/obj/item/paper/fluff/abductor/riotshotgun
	name = "Ballistic Weapon Research Goals: Riot Shotgun"
	default_raw_text = {"<b>☼︎♏︎⬧︎♏︎♋︎❒︎♍︎♒︎ ☝︎□︎♋︎●︎ 👌︎❒︎♓︎♏︎♐︎♓︎■︎♑︎🖳︎ 'Riot Shotgun'</b><br>

<br>
✌︎︎⬧︎︎ ◻︎︎❒︎︎♏︎︎❖︎︎♓︎︎□︎︎◆︎︎⬧︎︎●︎︎⍓︎︎ ♌︎︎❒︎︎♓︎︎♏︎︎♐︎︎♏︎︎♎︎︎📪︎︎ ♏︎︎♋︎︎♍︎︎♒︎︎ ●︎︎♋︎︎♌︎︎ ♓︎︎■︎︎ ⧫︎︎♒︎︎♏︎︎ ❒︎︎♏︎︎⬧︎︎♏︎︎♋︎︎❒︎︎♍︎︎♒︎︎ ♎︎︎♓︎︎❖︎︎♓︎︎⬧︎︎♓︎︎□︎︎■︎︎ ♒︎︎♋︎︎⬧︎︎ ♌︎︎♏︎︎♏︎︎■︎︎ ♎︎︎♏︎︎●︎︎♓︎︎❖︎︎♏︎︎❒︎︎♏︎︎♎︎︎ ♋︎︎ ❒︎︎♏︎︎♍︎︎□︎︎❖︎︎♏︎︎❒︎︎♏︎︎♎︎︎ ⬥︎︎♏︎︎♋︎︎◻︎︎□︎︎■︎︎ ♐︎︎❒︎︎□︎︎❍︎︎ □︎︎◆︎︎❒︎︎ ☝︎︎❒︎︎□︎︎◆︎︎◻︎︎⬧︎︎ □︎︎♐︎︎ ☞︎︎□︎︎♍︎︎◆︎︎⬧︎︎📪︎︎ □︎︎♐︎︎⧫︎︎♏︎︎■︎︎ ♎︎︎♏︎︎◻︎︎●︎︎□︎︎⍓︎︎♏︎︎♎︎︎ □︎︎■︎︎ □︎︎❒︎︎ ■︎︎♏︎︎♋︎︎❒︎︎ 💧︎︎◻︎︎♋︎︎♍︎︎♏︎︎ 💧︎︎⧫︎︎♋︎︎⧫︎︎♓︎︎□︎︎■︎︎ 📂︎︎🗏︎︎📬︎︎ ✡︎︎□︎︎◆︎︎ ♋︎︎❒︎︎♏︎︎ ⧫︎︎□︎︎ ⧫︎︎❒︎︎♏︎︎♋︎︎⧫︎︎ ⧫︎︎♒︎︎♏︎︎⬧︎︎♏︎︎ ⬥︎︎♏︎︎♋︎︎◻︎︎□︎︎■︎︎⬧︎︎ ⬧︎︎♏︎︎♍︎︎◆︎︎❒︎︎♏︎︎●︎︎⍓︎︎ ♋︎︎⬧︎︎ ⍓︎︎□︎︎◆︎︎ ⬥︎︎□︎︎◆︎︎●︎︎♎︎︎ ⬥︎︎♓︎︎⧫︎︎♒︎︎ ♋︎︎■︎︎⍓︎︎ □︎︎⧫︎︎♒︎︎♏︎︎❒︎︎ ❒︎︎♏︎︎♍︎︎□︎︎❖︎︎♏︎︎❒︎︎♏︎︎♎︎︎ ⬧︎︎◆︎︎♌︎︎🙰♏︎︎♍︎︎⧫︎︎📬︎︎
💣︎♋︎♓︎■︎ 💣︎♏︎♎︎♓︎♍︎♋︎●︎ 💧︎◆︎♓︎⧫︎♏︎🖳︎︎︎ ✡︎□︎◆︎ ♒︎♋︎❖︎♏︎ ♌︎♏︎♏︎■︎ ♓︎⬧︎⬧︎◆︎♏︎♎︎ ⧫︎♒︎♏︎ ◆︎■︎◆︎⬧︎◆︎♋︎●︎●︎⍓︎ ❍︎□︎♎︎◆︎●︎♋︎❒︎ ⬥︎♏︎♋︎◻︎□︎■︎ ❒︎♏︎♐︎♏︎❒︎❒︎♏︎♎︎ ⧫︎□︎ ♋︎⬧︎ ♋︎ 🕯︎☼︎♓︎□︎⧫︎ 💧︎♒︎□︎⧫︎♑︎◆︎■︎🕯︎📪︎ ♋︎●︎□︎■︎♑︎ ⬥︎♓︎⧫︎♒︎ ⬧︎♏︎❖︎♏︎❒︎♋︎●︎ ⧫︎⍓︎◻︎♏︎⬧︎ □︎♐︎ ♍︎♋︎❒︎⧫︎❒︎♓︎♎︎♑︎♏︎ ⧫︎♒︎♏︎❒︎♏︎□︎♐︎📬︎ 🕈︎♏︎ ♋︎❒︎♏︎ ◆︎■︎⬧︎◆︎❒︎♏︎ □︎♐︎ ⧫︎♒︎♏︎ ❖︎♋︎❒︎♓︎♏︎♎︎ ◆︎⬧︎♏︎⬧︎ ♋︎■︎♎︎ ♏︎♐︎♐︎♏︎♍︎⧫︎⬧︎ □︎♐︎ ⧫︎♒︎♏︎⬧︎♏︎ ◻︎❒︎□︎🙰♏︎♍︎⧫︎♓︎●︎♏︎⬧︎ ♋︎■︎♎︎ ⬥︎□︎◆︎●︎♎︎ ●︎♓︎🙵♏︎ ⍓︎□︎◆︎ ⧫︎□︎ ⧫︎♏︎⬧︎⧫︎ □︎■︎ ⧫︎♒︎♏︎ ♒︎◆︎❍︎♋︎■︎📫︎♋︎■︎♋︎●︎♋︎♑︎□︎◆︎⬧︎ ⬧︎♓︎❍︎♓︎♋︎■︎⬧︎ ♍︎❒︎♏︎♋︎⧫︎♏︎♎︎ ♌︎⍓︎ 🕯︎❍︎□︎■︎🙵♏︎⍓︎ ♍︎◆︎♌︎♏︎⬧︎🕯︎ ⧫︎□︎ ◆︎■︎♎︎♏︎❒︎⬧︎⧫︎♋︎■︎♎︎ ⧫︎♒︎♏︎ ❒︎♏︎♋︎⬧︎□︎■︎♓︎■︎♑︎ ♌︎♏︎♒︎♓︎■︎♎︎ ⧫︎♒︎♏︎ ❖︎♋︎⬧︎⧫︎ ♋︎❒︎❒︎♋︎⍓︎ □︎♐︎ ♎︎♓︎♐︎♐︎♏︎❒︎♏︎■︎⧫︎ ◻︎❒︎□︎🙰♏︎♍︎⧫︎♓︎●︎♏︎ ⧫︎⍓︎◻︎♏︎⬧︎📬︎<br>
🏱︎︎︎❒︎︎︎□︎︎︎❖︎︎︎♓︎︎︎♎︎︎︎♏︎︎︎♎︎︎︎ ♋︎︎︎❒︎︎︎♏︎︎︎ ♌︎□︎⌧︎♏︎⬧︎ □︎♐︎ 🕯︎⬧︎♒︎♏︎●︎●︎⬧︎🕯︎ ♐︎□︎❒︎ ⧫︎♒︎♏︎ ☼︎♓︎□︎⧫︎ 💧︎♒︎□︎⧫︎♑︎◆︎■︎ ♋︎■︎♎︎ ⧫︎♒︎♏︎ ⬥︎♏︎♋︎◻︎□︎■︎ ♓︎⧫︎⬧︎♏︎●︎♐︎📬︎<br>"}

/obj/item/paper/fluff/abductor/nt20
	name = "Ballistic Weapon Research Goals: NT-20"
	default_raw_text = {"<b>☼︎♏︎⬧︎♏︎♋︎❒︎♍︎♒︎ ☝︎□︎♋︎●︎ 👌︎❒︎♓︎♏︎♐︎♓︎■︎♑︎🖳︎ 'NT-20'</b><br>

<br>
✌︎︎⬧︎︎ ◻︎︎❒︎︎♏︎︎❖︎︎♓︎︎□︎︎◆︎︎⬧︎︎●︎︎⍓︎︎ ♌︎︎❒︎︎♓︎︎♏︎︎♐︎︎♏︎︎♎︎︎📪︎︎ ♏︎︎♋︎︎♍︎︎♒︎︎ ●︎︎♋︎︎♌︎︎ ♓︎︎■︎︎ ⧫︎︎♒︎︎♏︎︎ ❒︎︎♏︎︎⬧︎︎♏︎︎♋︎︎❒︎︎♍︎︎♒︎︎ ♎︎︎♓︎︎❖︎︎♓︎︎⬧︎︎♓︎︎□︎︎■︎︎ ♒︎︎♋︎︎⬧︎︎ ♌︎︎♏︎︎♏︎︎■︎︎ ♎︎︎♏︎︎●︎︎♓︎︎❖︎︎♏︎︎❒︎︎♏︎︎♎︎︎ ♋︎︎ ❒︎︎♏︎︎♍︎︎□︎︎❖︎︎♏︎︎❒︎︎♏︎︎♎︎︎ ⬥︎︎♏︎︎♋︎︎◻︎︎□︎︎■︎︎ ♐︎︎❒︎︎□︎︎❍︎︎ □︎︎◆︎︎❒︎︎ ☝︎︎❒︎︎□︎︎◆︎︎◻︎︎⬧︎︎ □︎︎♐︎︎ ☞︎︎□︎︎♍︎︎◆︎︎⬧︎︎📪︎︎ □︎︎♐︎︎⧫︎︎♏︎︎■︎︎ ♎︎︎♏︎︎◻︎︎●︎︎□︎︎⍓︎︎♏︎︎♎︎︎ □︎︎■︎︎ □︎︎❒︎︎ ■︎︎♏︎︎♋︎︎❒︎︎ 💧︎︎◻︎︎♋︎︎♍︎︎♏︎︎ 💧︎︎⧫︎︎♋︎︎⧫︎︎♓︎︎□︎︎■︎︎ 📂︎︎🗏︎︎📬︎︎ ✡︎︎□︎︎◆︎︎ ♋︎︎❒︎︎♏︎︎ ⧫︎︎□︎︎ ⧫︎︎❒︎︎♏︎︎♋︎︎⧫︎︎ ⧫︎︎♒︎︎♏︎︎⬧︎︎♏︎︎ ⬥︎︎♏︎︎♋︎︎◻︎︎□︎︎■︎︎⬧︎︎ ⬧︎︎♏︎︎♍︎︎◆︎︎❒︎︎♏︎︎●︎︎⍓︎︎ ♋︎︎⬧︎︎ ⍓︎︎□︎︎◆︎︎ ⬥︎︎□︎︎◆︎︎●︎︎♎︎︎ ⬥︎︎♓︎︎⧫︎︎♒︎︎ ♋︎︎■︎︎⍓︎︎ □︎︎⧫︎︎♒︎︎♏︎︎❒︎︎ ❒︎︎♏︎︎♍︎︎□︎︎❖︎︎♏︎︎❒︎︎♏︎︎♎︎︎ ⬧︎︎◆︎︎♌︎︎🙰♏︎︎♍︎︎⧫︎︎📬︎︎<br>
💧︎◆︎♌︎🙰♏︎♍︎⧫︎ ✋︎■︎⧫︎♏︎❒︎❒︎□︎♑︎♋︎⧫︎♓︎□︎■︎ ♋︎■︎♎︎ 👌︎❒︎♓︎♑︎♑︎♓︎■︎♑︎🖳︎︎︎ ✡︎□︎◆︎ ♒︎♋︎❖︎♏︎ ♌︎♏︎♏︎■︎ ♓︎⬧︎⬧︎◆︎♏︎♎︎ ⧫︎♒︎♏︎ ◆︎■︎◆︎⬧︎◆︎♋︎●︎●︎⍓︎ ◻︎□︎⬥︎♏︎❒︎♐︎◆︎●︎ 🕯︎☠︎♋︎■︎□︎⧫︎❒︎♋︎⬧︎♏︎■︎ ✌︎❒︎❍︎□︎❒︎♓︎♏︎⬧︎🕯︎ ☠︎❄︎📫︎📄︎📁︎📬︎ ✋︎⧫︎ ♓︎⬧︎ ♋︎ ⬥︎♏︎♋︎◻︎□︎■︎ ⧫︎♒︎♋︎⧫︎ ♌︎♏︎♋︎❒︎⬧︎ ❍︎◆︎♍︎♒︎ ❒︎♏︎⬧︎♏︎❍︎♌︎●︎♋︎■︎♍︎♏︎ ⧫︎□︎ ⧫︎♒︎♏︎ ♏︎❑︎◆︎♓︎◻︎❍︎♏︎■︎⧫︎ ◆︎⬧︎♏︎♎︎ ♌︎⍓︎ ♐︎□︎❒︎♍︎♏︎♎︎ □︎♐︎ ⧫︎♒︎♏︎ 🕯︎💧︎⍓︎■︎♎︎♓︎♍︎♋︎⧫︎♏︎🕯︎📪︎ ♋︎■︎♎︎ ⬥︎♏︎ ♒︎♋︎❖︎♏︎ ⬧︎♏︎♏︎■︎ ♐︎♓︎❒︎⬧︎⧫︎♒︎♋︎■︎♎︎ ♓︎⧫︎⬧︎ ♏︎♐︎♐︎♓︎♍︎♋︎♍︎⍓︎🖴︎ ♓︎⧫︎ ♓︎⬧︎ ⧫︎♒︎♏︎❒︎♏︎♐︎□︎❒︎♏︎ ⍓︎□︎◆︎❒︎ ♑︎□︎♋︎●︎ ⧫︎□︎ ♓︎■︎⧫︎♏︎❒︎❒︎□︎♑︎♋︎⧫︎♏︎ ⬧︎◆︎♌︎🙰♏︎♍︎⧫︎⬧︎ □︎♐︎ ☠︎♋︎■︎□︎⧫︎❒︎♋︎⬧︎♏︎■︎ ⧫︎□︎ ♋︎⬧︎♍︎♏︎❒︎⧫︎♋︎♓︎■︎ ⧫︎♒︎♏︎ ⬧︎□︎◆︎❒︎♍︎♏︎ □︎♐︎ ⧫︎♒︎♓︎⬧︎ ⬧︎♓︎❍︎♓︎●︎♋︎❒︎♓︎⧫︎⍓︎📪︎ ♋︎■︎♎︎ ♏︎⌧︎◻︎●︎♋︎♓︎■︎ ⧫︎♒︎♏︎ ♏︎■︎♑︎♓︎■︎♏︎♏︎❒︎♓︎■︎♑︎ ♌︎♏︎♒︎♓︎■︎♎︎ ⧫︎♒︎♏︎⬧︎♏︎ ◆︎■︎◆︎⬧︎◆︎♋︎●︎●︎⍓︎ ♏︎♐︎♐︎♏︎♍︎⧫︎♓︎❖︎♏︎ ♌︎♋︎●︎●︎♓︎⬧︎⧫︎♓︎♍︎⬧︎📬︎<br>
🏱︎︎︎❒︎︎︎□︎︎︎❖︎︎︎♓︎︎︎♎︎︎︎♏︎︎︎♎︎︎︎ ♋︎❒︎♏︎ ⧫︎⬥︎□︎ ♓︎■︎⬧︎⧫︎♋︎■︎♍︎♏︎⬧︎ □︎♐︎ ⧫︎♒︎♏︎ ⬥︎♏︎♋︎◻︎□︎■︎ 📫︎ ⧫︎♒︎♏︎ □︎■︎●︎⍓︎ ⧫︎⬥︎□︎ ♓︎■︎ ⬥︎♒︎♓︎♍︎♒︎ ⬥︎♏︎ ♒︎♋︎❖︎♏︎ 📫︎ ♋︎■︎♎︎ ⬧︎♏︎❖︎♏︎❒︎♋︎●︎ ❍︎♋︎♑︎♋︎⌘︎♓︎■︎♏︎⬧︎ ⧫︎♒︎♏︎❒︎♏︎□︎♐︎📬︎<br>"}

/obj/item/paper/fluff/abductor/weaponresearch
	name = "Ballistic Weapon Research Program"
	default_raw_text = {"☟︎♏︎♋︎♎︎ □︎♐︎ 💧︎♏︎♍︎◆︎❒︎♓︎⧫︎⍓︎ 👌︎●︎♏︎♏︎♌︎●︎♏︎⬧︎❍︎□︎❒︎◻︎📪︎</b><br>
✌︎⬧︎ ⍓︎□︎◆︎ ♒︎♋︎❖︎♏︎ ♌︎♏︎♏︎■︎ ❍︎♋︎♎︎♏︎ ♋︎⬥︎♋︎❒︎♏︎📪︎ ⬥︎♏︎ ♋︎❒︎♏︎ ⧫︎□︎ ♌︎♏︎ ♍︎□︎■︎♎︎◆︎♍︎⧫︎♓︎■︎♑︎ ■︎◆︎❍︎♏︎❒︎□︎◆︎⬧︎ ♎︎♏︎♍︎□︎■︎⬧︎⧫︎❒︎◆︎♍︎⧫︎♓︎❖︎♏︎ ♋︎■︎♎︎ ♐︎♓︎♏︎●︎♎︎ ⧫︎♏︎⬧︎⧫︎⬧︎ □︎■︎ ⧫︎♒︎♏︎ ⬥︎♏︎♋︎◻︎□︎■︎❒︎⍓︎ ◆︎⬧︎♏︎♎︎ ♌︎⍓︎ ◻︎❒︎♓︎❍︎♓︎⧫︎♓︎❖︎♏︎⬧︎📬︎ ✡︎□︎◆︎ ⬥︎♓︎●︎●︎ ♌︎♏︎ ♑︎♓︎❖︎♏︎■︎ ⬥︎♏︎♋︎◻︎□︎■︎ ⬥︎♏︎ ♋︎❒︎♏︎ ■︎□︎⧫︎ ⍓︎♏︎⧫︎ ◻︎❒︎♏︎◻︎♋︎❒︎♏︎♎︎ ⧫︎□︎ ♎︎♏︎♍︎□︎■︎⬧︎⧫︎❒︎◆︎♍︎⧫︎ □︎❒︎ ♋︎■︎♋︎●︎⍓︎⌘︎♏︎📪︎ ♋︎■︎♎︎ ♋︎♎︎♎︎♓︎⧫︎♓︎□︎■︎♋︎●︎ ♍︎♋︎❒︎⧫︎❒︎♓︎♎︎♑︎♏︎⬧︎ ⧫︎♒︎♏︎❒︎♏︎□︎♐︎🖴︎ ⬥︎♏︎♋︎◻︎□︎■︎⬧︎ ⬥︎♓︎⧫︎♒︎♓︎■︎ ⍓︎□︎◆︎❒︎ ◻︎□︎⬧︎⬧︎♏︎⬧︎⬧︎♓︎□︎■︎ ♋︎❒︎♏︎ ⧫︎□︎ ♌︎♏︎ ⧫︎❒︎♏︎♋︎⧫︎♏︎♎︎ ⬥︎♓︎⧫︎♒︎ ◆︎⧫︎❍︎□︎⬧︎⧫︎ ❒︎♏︎⬧︎◻︎♏︎♍︎⧫︎📪︎ ♋︎■︎⍓︎ ♍︎♒︎♋︎■︎♑︎♏︎♎︎ □︎■︎ ⧫︎♒︎♏︎❍︎ ♋︎❒︎♏︎ ⧫︎□︎ ♌︎♏︎ ■︎□︎⧫︎♏︎♎︎📪︎ ♋︎■︎♎︎ ♋︎■︎⍓︎ ♓︎⬧︎⬧︎◆︎♓︎■︎♑︎ □︎♐︎ ⧫︎♒︎♏︎❍︎ ♐︎□︎❒︎ ◻︎◆︎❒︎◻︎□︎⬧︎♏︎⬧︎ □︎♐︎ ⬧︎♏︎♍︎◆︎❒︎♓︎⧫︎⍓︎ □︎❒︎ ❒︎♏︎⬧︎♏︎♋︎❒︎♍︎♒︎ ♓︎⬧︎ ⧫︎□︎ ♌︎♏︎ ♐︎□︎❒︎⬥︎♋︎❒︎♎︎♏︎♎︎ ⧫︎□︎ ♋︎■︎♎︎ ♋︎◻︎◻︎❒︎□︎❖︎♏︎♎︎ ♌︎⍓︎ ♍︎□︎❍︎❍︎♋︎■︎♎︎ ♌︎♏︎♐︎□︎❒︎♏︎ ♋︎♍︎⧫︎♓︎□︎■︎📬︎<br>"}

/obj/item/paper/fluff/abductor/rdtactics
	name = "Research Opportunity: Primitive Tactics"
	default_raw_text = {"<b>☼︎︎♏︎︎⬧︎︎♏︎︎♋︎︎❒︎︎♍︎︎♒︎︎ ☝︎︎□︎︎♋︎︎●︎︎ 👌︎︎❒︎︎♓︎︎♏︎︎♐︎︎♓︎︎■︎︎♑︎︎🖳︎︎ 🏱︎❒︎♓︎❍︎♓︎⧫︎♓︎❖︎♏︎ ❄︎♋︎♍︎⧫︎♓︎♍︎⬧︎</b><br>

☼︎♏︎⬧︎♏︎♋︎❒︎♍︎♒︎ 🕈︎♓︎■︎♑︎📪︎<br>
☼︎♏︎♍︎♏︎■︎⧫︎ □︎♌︎⬧︎♏︎❒︎❖︎♋︎⧫︎♓︎□︎■︎⬧︎ □︎♐︎ ◻︎❒︎♓︎❍︎♓︎⧫︎♓︎❖︎♏︎⬧︎📪︎ ♌︎□︎⧫︎♒︎ ♓︎■︎ ⧫︎♒︎♏︎ ⬥︎♓︎●︎♎︎ ♋︎■︎♎︎ ♎︎◆︎❒︎♓︎■︎♑︎ ⬧︎♓︎❍︎◆︎●︎♋︎⧫︎♓︎□︎■︎⬧︎📪︎ ♒︎♋︎❖︎♏︎ ●︎♏︎♎︎ ⧫︎□︎ □︎◆︎❒︎ ■︎□︎⧫︎♓︎♍︎♓︎■︎♑︎ ⧫︎♒︎♏︎♓︎❒︎ ◆︎⬧︎♏︎ □︎♐︎ ❍︎♋︎■︎⍓︎ ■︎♋︎⧫︎◆︎❒︎♋︎●︎ ❒︎♏︎⬧︎□︎◆︎❒︎♍︎♏︎⬧︎ 🕿︎⬧︎♋︎■︎♎︎ ♋︎■︎♎︎ ⬥︎□︎□︎♎︎ ♌︎♏︎♓︎■︎♑︎ ◻︎❒︎♓︎❍︎♏︎ ♏︎⌧︎♋︎❍︎◻︎●︎♏︎⬧︎✆︎ ♋︎⬧︎ ♌︎□︎⧫︎♒︎ ❍︎♓︎●︎♓︎⧫︎♋︎❒︎⍓︎ ♋︎■︎♎︎ ♓︎❍︎◻︎❒︎□︎❖︎♓︎⬧︎♏︎♎︎ ♌︎♋︎❒︎❒︎♓︎♍︎♋︎♎︎♏︎⬧︎📬︎<br>
✋︎■︎ ⧫︎♒︎♏︎ ♓︎■︎⧫︎♏︎❒︎♏︎⬧︎⧫︎ □︎♐︎ ♐︎◆︎❒︎⧫︎♒︎♏︎❒︎♓︎■︎♑︎ □︎◆︎❒︎ ◆︎■︎♎︎♏︎❒︎⬧︎⧫︎♋︎■︎♎︎♓︎■︎♑︎ □︎♐︎ ⧫︎♒︎♏︎⬧︎♏︎ ⧫︎♋︎♍︎⧫︎♓︎♍︎⬧︎📪︎ ⬥︎♏︎ ❒︎♏︎❑︎◆︎♏︎⬧︎⧫︎ ⧫︎♒︎♋︎⧫︎ ⍓︎□︎◆︎ ❍︎♓︎❍︎♓︎♍︎ ⧫︎♒︎♏︎❍︎ 🕿︎⬥︎♓︎⧫︎♒︎ ⧫︎♒︎♏︎ ♎︎□︎⬧︎⬧︎♓︎♏︎❒︎⬧︎ □︎♐︎ ⧫︎♒︎♏︎♓︎❒︎ ♓︎■︎⧫︎❒︎♓︎♍︎♋︎♍︎♓︎♏︎⬧︎ ◻︎❒︎□︎❖︎♓︎♎︎♏︎♎︎✆︎ ⧫︎□︎ ⧫︎♒︎♏︎ ♌︎♏︎⬧︎⧫︎ □︎♐︎ ⍓︎□︎◆︎❒︎ ♋︎♌︎♓︎●︎♓︎⧫︎⍓︎ ♓︎■︎ ⧫︎♒︎♏︎ ♏︎❖︎♏︎■︎⧫︎ □︎♐︎ ♋︎■︎ ♋︎⧫︎⧫︎♋︎♍︎🙵📬︎ 🕈︎□︎□︎♎︎ ⬧︎♋︎❍︎◻︎●︎♏︎⬧︎ ♋︎■︎♎︎ ⬧︎♋︎■︎♎︎ ♌︎♋︎♑︎⬧︎ ♒︎♋︎❖︎♏︎ ♌︎♏︎♏︎■︎ ◻︎❒︎□︎❖︎♓︎♎︎♏︎♎︎ ♋︎⬧︎ ⬥︎♏︎●︎●︎📬︎<br>"}

